Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.110/PIC32CM-LS60/atdf/PIC32CM5164LS60100.atdf
            <register-group name="PAC_SEC" name-in-module="PAC" address-space="base" offset="0x40000200"/>
            <parameters>
              <param name="HPB_NUM" value="3" caption="Number of bridges AHB/APB"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="3c0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="1" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
              <param name="HAS_IDLE2_SLEEP_AS_IDLE" value="1" caption="IDLE2 Sleep mode is called IDLE"/>
              <param name="HAS_BBIASTR_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_DPGPDSW_BIT" value="1" caption="one if RAM HS can be back biased"/>
              <param name="HAS_PLCFG" value="1" caption="Performance Level Configuration supported"/>
              <param name="HAS_PDCFG_BIT" value="1" caption="PDCFG bit is present"/>
              <param name="HAS_PWCFG" value="1" caption="PWCFG register is present"/>
              <param name="HAS_OFF_SLEEP" value="1" caption="OFF Sleep mode supported"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="3.1.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x40003000"/>
            <register-group name="PORT_SEC" name-in-module="PORT" address-space="base" offset="0x40003200"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <register-group name="PORT_IOBUS_SEC" name-in-module="PORT" address-space="base" offset="0x60000200"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="62" function="default" pad="PB30"/>
              <signal group="P" index="63" function="default" pad="PB31"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
            </signals>
            <parameters>
              <param name="BITS" value="93"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported?"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="3"/>
              <param name="MSB" value="92"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported?"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="IOBUS2 implemented?"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported?"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for PORT"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="5.0.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004000"/>
            <signals>
              <signal group="DRV" index="0" function="F" pad="PA00"/>
              <signal group="DRV" index="1" function="F" pad="PA01"/>
              <signal group="DRV" index="2" function="F" pad="PA02"/>
              <signal group="DRV" index="3" function="F" pad="PA03"/>
              <signal group="DRV" index="4" function="F" pad="PA05"/>
              <signal group="DRV" index="5" function="F" pad="PA06"/>
              <signal group="DRV" index="6" function="F" pad="PA08"/>
              <signal group="DRV" index="7" function="F" pad="PA09"/>
              <signal group="DRV" index="8" function="F" pad="PA10"/>
              <signal group="DRV" index="9" function="F" pad="PA11"/>
              <signal group="DRV" index="10" function="F" pad="PA14"/>
              <signal group="DRV" index="11" function="F" pad="PA15"/>
              <signal group="DRV" index="12" function="F" pad="PA16"/>
              <signal group="DRV" index="13" function="F" pad="PA17"/>
              <signal group="DRV" index="14" function="F" pad="PA18"/>
              <signal group="DRV" index="15" function="F" pad="PA19"/>
              <signal group="DRV" index="16" function="F" pad="PA22"/>
              <signal group="DRV" index="17" function="F" pad="PA23"/>
              <signal group="DRV" index="18" function="F" pad="PA30"/>
              <signal group="DRV" index="19" function="F" pad="PA31"/>
              <signal group="DRV" index="20" function="F" pad="PB08"/>
              <signal group="DRV" index="21" function="F" pad="PB09"/>
              <signal group="DRV" index="22" function="F" pad="PA20"/>
              <signal group="DRV" index="23" function="F" pad="PA21"/>
              <signal group="DRV" index="24" function="F" pad="PA12"/>
              <signal group="DRV" index="25" function="F" pad="PA13"/>
              <signal group="DRV" index="26" function="F" pad="PB04"/>
              <signal group="DRV" index="27" function="F" pad="PB05"/>
              <signal group="DRV" index="28" function="F" pad="PB06"/>
              <signal group="DRV" index="29" function="F" pad="PB07"/>
              <signal group="DRV" index="30" function="F" pad="PB12"/>
              <signal group="DRV" index="31" function="F" pad="PB13"/>
              <signal group="ECI" index="0" function="B" pad="PA03"/>
              <signal group="ECI" index="1" function="B" pad="PA04"/>
              <signal group="ECI" index="2" function="B" pad="PA05"/>
              <signal group="ECI" index="3" function="B" pad="PA06"/>
              <signal group="X" index="0" function="B" pad="PA00"/>
              <signal group="Y" index="0" function="B" pad="PA00"/>
              <signal group="X" index="1" function="B" pad="PA01"/>
              <signal group="Y" index="1" function="B" pad="PA01"/>
              <signal group="X" index="2" function="B" pad="PA02"/>
              <signal group="Y" index="2" function="B" pad="PA02"/>
              <signal group="X" index="3" function="B" pad="PA03"/>
              <signal group="Y" index="3" function="B" pad="PA03"/>
              <signal group="X" index="4" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA05"/>
              <signal group="X" index="5" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA06"/>
              <signal group="X" index="6" function="B" pad="PA08"/>
              <signal group="Y" index="6" function="B" pad="PA08"/>
              <signal group="X" index="7" function="B" pad="PA09"/>
              <signal group="Y" index="7" function="B" pad="PA09"/>
              <signal group="X" index="8" function="B" pad="PA10"/>
              <signal group="Y" index="8" function="B" pad="PA10"/>
              <signal group="X" index="9" function="B" pad="PA11"/>
              <signal group="Y" index="9" function="B" pad="PA11"/>
              <signal group="X" index="10" function="B" pad="PA14"/>
              <signal group="Y" index="10" function="B" pad="PA14"/>
              <signal group="X" index="11" function="B" pad="PA15"/>
              <signal group="Y" index="11" function="B" pad="PA15"/>
              <signal group="X" index="12" function="B" pad="PA16"/>
              <signal group="Y" index="12" function="B" pad="PA16"/>
              <signal group="X" index="13" function="B" pad="PA17"/>
              <signal group="Y" index="13" function="B" pad="PA17"/>
              <signal group="X" index="14" function="B" pad="PA18"/>
              <signal group="Y" index="14" function="B" pad="PA18"/>
              <signal group="X" index="15" function="B" pad="PA19"/>
              <signal group="Y" index="15" function="B" pad="PA19"/>
              <signal group="X" index="16" function="B" pad="PA22"/>
              <signal group="Y" index="16" function="B" pad="PA22"/>
              <signal group="X" index="17" function="B" pad="PA23"/>
              <signal group="Y" index="17" function="B" pad="PA23"/>
              <signal group="X" index="18" function="B" pad="PA30"/>
              <signal group="Y" index="18" function="B" pad="PA30"/>
              <signal group="X" index="19" function="B" pad="PA31"/>
              <signal group="Y" index="19" function="B" pad="PA31"/>
              <signal group="X" index="20" function="B" pad="PB08"/>
              <signal group="Y" index="20" function="B" pad="PB08"/>
              <signal group="X" index="21" function="B" pad="PB09"/>
              <signal group="Y" index="21" function="B" pad="PB09"/>
              <signal group="X" index="22" function="B" pad="PA20"/>
              <signal group="Y" index="22" function="B" pad="PA20"/>
              <signal group="X" index="23" function="B" pad="PA21"/>
              <signal group="Y" index="23" function="B" pad="PA21"/>
              <signal group="X" index="24" function="B" pad="PA12"/>
              <signal group="Y" index="24" function="B" pad="PA12"/>
              <signal group="X" index="25" function="B" pad="PA13"/>
              <signal group="Y" index="25" function="B" pad="PA13"/>
              <signal group="X" index="26" function="B" pad="PB04"/>
              <signal group="Y" index="26" function="B" pad="PB04"/>
              <signal group="X" index="27" function="B" pad="PB05"/>
              <signal group="Y" index="27" function="B" pad="PB05"/>
              <signal group="X" index="28" function="B" pad="PB06"/>
              <signal group="Y" index="28" function="B" pad="PB06"/>
              <signal group="X" index="29" function="B" pad="PB07"/>
              <signal group="Y" index="29" function="B" pad="PB07"/>
              <signal group="X" index="30" function="B" pad="PB12"/>
              <signal group="Y" index="30" function="B" pad="PB12"/>
              <signal group="X" index="31" function="B" pad="PB13"/>
              <signal group="Y" index="31" function="B" pad="PB13"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="44" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="45" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="46" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="LINES_MSB" value="31"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="80" caption="Instance index for PTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="3b0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="0"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="3a1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <signals>
              <signal group="IN" index="0" function="G" pad="PA08"/>
              <signal group="IN" index="1" function="G" pad="PA09"/>
              <signal group="IN" index="2" function="G" pad="PA16"/>
              <signal group="IN" index="3" function="G" pad="PA17"/>
              <signal group="IN" index="4" function="G" pad="PB14"/>
              <signal group="IN" index="5" function="G" pad="PB15"/>
              <signal group="IN" index="6" function="G" pad="PC14"/>
              <signal group="IN" index="7" function="G" pad="PC15"/>
              <signal group="OUT" index="0" function="G" pad="PA18"/>
              <signal group="OUT" index="1" function="G" pad="PA19"/>
              <signal group="OUT" index="2" function="G" pad="PA22"/>
              <signal group="OUT" index="3" function="G" pad="PA23"/>
              <signal group="OUT" index="4" function="G" pad="PB16"/>
              <signal group="OUT" index="5" function="G" pad="PB17"/>
              <signal group="OUT" index="6" function="G" pad="PB18"/>
              <signal group="OUT" index="7" function="G" pad="PB19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="1" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="Number of Tamper Inputs"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
            </parameters>
          </instance>
        </module>
        <module name="SCB" version="1.0.0">
          <instance name="SCB">
            <register-group name="SCB" name-in-module="SCB" address-space="base" offset="0xE000ED00"/>
